app/controllers/exercises_controller.rb

  def index
    @exercises = Exercise.all
---
SELECT * FROM "exercises"

  def show
    @exercise = Exercise.find(params[:id])
---
SELECT * FROM "exercises" WHERE ("exercises"."id" = 1)

  def create
    @exercise = Exercise.new(params[:exercise])
  time = Time.now.to_i.to_s
  @exercise.chapter = @exercise.chapter + ("#") + time
    if @exercise.save
---
INSERT INTO "exercises" ("created_at", "title", "chapter", "updated_at", "question") VALUES('2010-08-06 12:32:48', 'Schwache Verben', '2.1', '2010-08-06 12:32:48', 'Markieren Sie im Textausschnitt unten die schwachen Verben und benennen Sie ihr Hauptmerkmal!

  def edit
    @exercise = Exercise.find(params[:id])
---
SELECT * FROM "exercises" WHERE ("exercises"."id" = 1)

  def update
    @exercise = Exercise.find(params[:id])
---
SELECT * FROM "exercises" WHERE ("exercises"."id" = 1)

  def destroy
    @exercise = Exercise.find(params[:id])
    @exercise.destroy_export
---
SELECT * FROM "exercises" WHERE ("exercises"."id" = 1)
DELETE FROM "exercises" WHERE "id" = 1

    def set_type_order
      mcs = @exercise.multiple_choices.reverse
      scs = @exercise.single_choices.reverse
      marks = @exercise.marktexts.reverse
      cloz = @exercise.clozes.reverse
      drops = @exercise.dropdowns.reverse
      order = @exercise.type_sequence_positions
      type_order = Array.new
      order.each do |type|
---
SELECT * FROM "type_sequence_positions" WHERE ("type_sequence_positions".exercise_id = 2)